e-yes/nuttx/arch/risc-v/src/bl702/hardware/bl702_sec.h
#define SE_AES_KEY_SEL_1_MASK              (0x03)

#define SE_AES_ENDIAN_CTR_LEN_SHIFT        (30)
#define SE_AES_ENDIAN_CTR_LEN_MASK         (0x03 << SE_AES_ENDIAN_CTR_LEN_SHIFT)
#define SE_AES_ENDIAN_IV_ENDIAN            (1 << 3)
#define SE_AES_ENDIAN_KEY_ENDIAN           (1 << 2)
#define SE_AES_ENDIAN_DIN_ENDIAN           (1 << 1)
#define SE_AES_ENDIAN_DOUT_ENDIAN          (1 << 0)

#define SE_AES_SBOOT_SBOOT_KEY_SEL         (1 << 0)

#define SE_AES_CTRL_PROT_ID1_EN            (1 << 2)
#define SE_AES_CTRL_PROT_ID0_EN            (1 << 1)
#define SE_AES_CTRL_PROT_PROT_EN           (1 << 0)

#define SE_TRNG_CTRL_0_MANUAL_EN           (1 << 15)
#define SE_TRNG_CTRL_0_MANUAL_RESEED       (1 << 14)
#define SE_TRNG_CTRL_0_MANUAL_FUN_SEL      (1 << 13)
#define SE_TRNG_CTRL_0_INT_MASK            (1 << 11)
#define SE_TRNG_CTRL_0_INT_SET_1T          (1 << 10)
#define SE_TRNG_CTRL_0_INT_CLR_1T          (1 << 9)
#define SE_TRNG_CTRL_0_INT                 (1 << 8)
#define SE_TRNG_CTRL_0_HT_ERROR            (1 << 4)
#define SE_TRNG_CTRL_0_DOUT_CLR_1T         (1 << 3)
#define SE_TRNG_CTRL_0_EN                  (1 << 2)
#define SE_TRNG_CTRL_0_TRIG_1T             (1 << 1)
#define SE_TRNG_CTRL_0_BUSY                (1 << 0)

#define SE_TRNG_TEST_HT_ALARM_N_SHIFT      (4)
#define SE_TRNG_TEST_HT_ALARM_N_MASK       (0xff << SE_TRNG_TEST_HT_ALARM_N_SHIFT)
#define SE_TRNG_TEST_HT_DIS                (1 << 3)
#define SE_TRNG_TEST_CP_BYPASS             (1 << 2)
#define SE_TRNG_TEST_CP_TEST_EN            (1 << 1)
#define SE_TRNG_TEST_TEST_EN               (1 << 0)

#define SE_TRNG_CTRL_2_SERESEED_N_MSB_MASK  (0xffff)

#define SE_TRNG_CTRL_3_ROSC_EN             (1 << 31)
#define SE_TRNG_CTRL_3_HT_OD_EN            (1 << 26)
#define SE_TRNG_CTRL_3_HT_APT_C_SHIFT      (16)
#define SE_TRNG_CTRL_3_HT_APT_C_MASK       (0x3ff << SE_TRNG_CTRL_3_HT_APT_C_SHIFT)
#define SE_TRNG_CTRL_3_HT_RCT_C_SHIFT      (8)
#define SE_TRNG_CTRL_3_HT_RCT_C_MASK       (0xff << SE_TRNG_CTRL_3_HT_RCT_C_SHIFT)
#define SE_TRNG_CTRL_3_CP_RATIO_MASK       (0xff)

#define SE_TRNG_CTRL_PROT_ID1_EN           (1 << 2)
#define SE_TRNG_CTRL_PROT_ID0_EN           (1 << 1)
#define SE_TRNG_CTRL_PROT_PROT_EN          (1 << 0)

#define SE_PKA_CTRL_0_STATUS_SHIFT         (17)
#define SE_PKA_CTRL_0_STATUS_MASK          (0x7fff << SE_PKA_CTRL_0_STATUS_SHIFT)
#define SE_PKA_CTRL_0_STATUS_CLR_1T        (1 << 16)
#define SE_PKA_CTRL_0_RAM_CLR_MD           (1 << 13)
#define SE_PKA_CTRL_0_ENDIAN               (1 << 12)
#define SE_PKA_CTRL_0_INT_MASK             (1 << 11)
#define SE_PKA_CTRL_0_INT_SET              (1 << 10)
#define SE_PKA_CTRL_0_INT_CLR_1T           (1 << 9)
#define SE_PKA_CTRL_0_INT                  (1 << 8)
#define SE_PKA_CTRL_0_PROT_MD_SHIFT        (4)
#define SE_PKA_CTRL_0_PROT_MD_MASK         (0x0f << SE_PKA_CTRL_0_PROT_MD_SHIFT)
#define SE_PKA_CTRL_0_EN                   (1 << 3)
#define SE_PKA_CTRL_0_BUSY                 (1 << 2)
#define SE_PKA_CTRL_0_DONE_CLR_1T          (1 << 1)
#define SE_PKA_CTRL_0_DONE                 (1 << 0)

#define SE_PKA_CTRL_1_HBYPASS              (1 << 3)
#define SE_PKA_CTRL_1_HBURST_MASK          (0x07)

#define SE_PKA_CTRL_PROT_ID1_EN            (1 << 2)
#define SE_PKA_CTRL_PROT_ID0_EN            (1 << 1)
#define SE_PKA_CTRL_PROT_PROT_EN           (1 << 0)

#define SE_CDET_CTRL_0_G_LOOP_MIN_SHIFT    (24)
#define SE_CDET_CTRL_0_G_LOOP_MIN_MASK     (0xff << SE_CDET_CTRL_0_G_LOOP_MIN_SHIFT)
#define SE_CDET_CTRL_0_G_LOOP_MAX_SHIFT    (16)
#define SE_CDET_CTRL_0_G_LOOP_MAX_MASK     (0xff << SE_CDET_CTRL_0_G_LOOP_MAX_SHIFT)
#define SE_CDET_CTRL_0_STATUS_SHIFT        (2)
#define SE_CDET_CTRL_0_STATUS_MASK         (0x3fff << SE_CDET_CTRL_0_STATUS_SHIFT)
#define SE_CDET_CTRL_0_ERROR               (1 << 1)
#define SE_CDET_CTRL_0_EN                  (1 << 0)

#define SE_CDET_CTRL_1_G_SLP_N_SHIFT       (16)
#define SE_CDET_CTRL_1_G_SLP_N_MASK        (0xff << SE_CDET_CTRL_1_G_SLP_N_SHIFT)
#define SE_CDET_CTRL_1_T_DLY_N_SHIFT       (8)
#define SE_CDET_CTRL_1_T_DLY_N_MASK        (0xff << SE_CDET_CTRL_1_T_DLY_N_SHIFT)
#define SE_CDET_CTRL_1_T_LOOP_N_MASK       (0xff)

#define SE_CDET_CTRL_PROT_ID1_EN           (1 << 2)
#define SE_CDET_CTRL_PROT_ID0_EN           (1 << 1)
#define SE_CDET_CTRL_PROT_PROT_EN          (1 << 0)

#define SE_GMAC_CTRL_0_X_ENDIAN            (1 << 14)
#define SE_GMAC_CTRL_0_H_ENDIAN            (1 << 13)
#define SE_GMAC_CTRL_0_T_ENDIAN            (1 << 12)
#define SE_GMAC_CTRL_0_INT_MASK            (1 << 11)
#define SE_GMAC_CTRL_0_INT_SET_1T          (1 << 10)
#define SE_GMAC_CTRL_0_INT_CLR_1T          (1 << 9)
#define SE_GMAC_CTRL_0_INT                 (1 << 8)
#define SE_GMAC_CTRL_0_EN                  (1 << 2)
#define SE_GMAC_CTRL_0_TRIG_1T             (1 << 1)
#define SE_GMAC_CTRL_0_BUSY                (1 << 0)

#define SE_GMAC_CTRL_PROT_ID1_EN           (1 << 2)
#define SE_GMAC_CTRL_PROT_ID0_EN           (1 << 1)
#define SE_GMAC_CTRL_PROT_PROT_EN          (1 << 0)

#define SE_CTRL_PROT_RD_DBG_DIS            (1 << 31)
#define SE_CTRL_PROT_RD_GMAC_ID1_EN_RD     (1 << 22)
#define SE_CTRL_PROT_RD_GMAC_ID0_EN_RD     (1 << 21)
#define SE_CTRL_PROT_RD_GMAC_PROT_EN_RD    (1 << 20)
#define SE_CTRL_PROT_RD_CDET_ID1_EN_RD     (1 << 18)
#define SE_CTRL_PROT_RD_CDET_ID0_EN_RD     (1 << 17)
#define SE_CTRL_PROT_RD_CDET_PROT_EN_RD    (1 << 16)
#define SE_CTRL_PROT_RD_PKA_ID1_EN_RD      (1 << 14)
#define SE_CTRL_PROT_RD_PKA_ID0_EN_RD      (1 << 13)
#define SE_CTRL_PROT_RD_PKA_PROT_EN_RD     (1 << 12)
#define SE_CTRL_PROT_RD_TRNG_ID1_EN_RD     (1 << 10)
#define SE_CTRL_PROT_RD_TRNG_ID0_EN_RD     (1 << 9)
#define SE_CTRL_PROT_RD_TRNG_PROT_EN_RD    (1 << 8)
#define SE_CTRL_PROT_RD_AES_ID1_EN_RD      (1 << 6)
#define SE_CTRL_PROT_RD_AES_ID0_EN_RD      (1 << 5)
#define SE_CTRL_PROT_RD_AES_PROT_EN_RD     (1 << 4)
#define SE_CTRL_PROT_RD_SHA_ID1_EN_RD      (1 << 2)
#define SE_CTRL_PROT_RD_SHA_ID0_EN_RD      (1 << 1)
#define SE_CTRL_PROT_RD_SHA_PROT_EN_RD     (1 << 0)

#endif /* __ARCH_RISCV_SRC_BL702_HARDWARE_BL702_SEC_H */
